DARhoSimpleFoamMRF/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 100);

boundaryField
{
    per1
    {
        type            cyclic;
    }
    per2
    {
        type            cyclic;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 100);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 100);
    }
    shroud
    {
        type            fixedValue;
        value           uniform (0 0 100);
    }
    hub
    {
        type            fixedValue;
        value           uniform (0 0 100);
    }
    blade
    {
        type            fixedValue;
        value           uniform (0 0 100);
    }
}


// ************************************************************************* //
