DARhoSimpleFoamMRF/system/topoSetDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  plus                                  | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    allcells;
        type    cellSet;
        action  clear;
    }
    {
        name    allcells;
        type    cellSet;
        action  invert;
    }
    {
        name    region0;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set allcells;
        }
    }

    {
        name    cyclics;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   "per.*";
    }
);